// Если отправка данных прошла успешно, показывается соответствующее сообщение. Разметку сообщения,
// которая находится блоке #success внутри шаблона template, нужно разместить перед закрывающим тегом
// </body>. Сообщение должно исчезать по нажатию на клавишу Esc и по клику на произвольную область экрана.

// Если при отправке данных произошла ошибка запроса, показывается соответствующее сообщение. Разметку
// сообщения, которая находится в блоке #error в шаблоне template, нужно разместить перед закрывающим
// тегом </body>. Сообщение должно исчезать после нажатия на кнопку .error__button, по нажатию на клавишу
// Esc и по клику на произвольную область экрана. В таком случае вся введённая пользователем информация
// сохраняется, чтобы у него была возможность отправить форму повторно.
